[
  {
    "Name": "Cách làm bò viên trắng giòn, thơm ngon ngay tại nhà",
    "Avatar": "Images/Changioham.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Cho hỗn hợp nước mắm, đường, tiêu, bột ngọt, dầu mè vào trộn đều. Sau đó cho thịt vào hỗn hợp, trộn đều, đeo găng tay trộn cho thịt thấm gia vị."
      },
      {
        "Images": "",
        "Description": "Tiếp tục trộn bột nở, bột khoai tây với nước, sau đó đổ vào hỗn hợp vừa trộn ở trên, rồi tiếp tục trộn thật đều cho đến khi thịt mịn."
      },
      {
        "Images": "",
        "Description": "Cho thịt vào bịch nylon, dàn trải ra cho mỏng và cất vào tủ đá khoảng 2 tiếng. Lúc này thịt lạnh, nhưng không đông cứng, lấy thịt ra đem ra xay nhuyễn một lần nữa."
      },
      {
        "Images": "",
        "Description": "Sau đó cho thịt lại vào túi nylon rồi cho vào ngăn đá để thêm gần 2 tiếng, lấy thịt ra có thể dùng dao cắt nhỏ hoặc bẻ ra rồi cho vào máy quết."
      },
      {
        "Images": "",
        "Description": "Quết từ từ cho đến khi dính đều khoảng 3 phút. Nếu không có máy các bạn có thể nhồi bằng tay, hoặc bỏ vào máy xay, xay nhè nhẹ cho thịt mịn."
      },
      {
        "Images": "Images/thit-bo-vien-3.jpg",
        "Description": "Lấy một tô nước lạnh lớn. Đeo găng tay, dùng tay phải múc một muỗng thịt cho vào tay trái và bóp thịt cho trồi lên phần ngón trỏ và ngón cái, dùng muỗng gạt vào tô nước lạnh. Cứ tiếp tục cho đến khi hết phần thịt."
      },
      {
        "Images": "Images/thit-bo-vien-4.jpg",
        "Description": "Cho một nồi nước lên bếp đun, cho thêm một chút muối và gừng cho nước đậm đà. Khi nước sôi bạn thả các viên bò vào luộc khoảng 10 phút là được. Sau đó, vớt bò viên ra một tô nước lạnh khác, làm như vậy sẽ giúp viên bò trắng, đẹp mắt mà không bị thâm."
      },
      {
        "Images": "",
        "Description": "Vớt bò viên ra để ráo nước, bảo quản trong tủ lạnh để ăn dần."
      }
    ],
    "Ingredients": [
      "1 kg thịt bò xay sẵn",
      "5 muỗng nước mắm",
      "6 muỗng nước",
      "2 muỗng tinh bột khoai lang tây hoặc bột năng",
      "1 muỗng cà phê đường",
      "Bột ngọt, hạt tiêu",
      "Bột nở",
      "Dầu mè",
      "Gừng, muối"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Mẹo muối dưa cải giòn ngon không bị khú",
    "Avatar": "Images/dua-cai-1.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Tách cải thành từng bẹ riêng, bỏ những lá già, dập. Sau đó đem phơi ngoài nắng cho hơi héo. Công đoạn này sẽ làm giảm hàm lượng nước trong dưa, khi muối dưa ít bị khú hơn."
      },
      {
        "Images": "Images/dua-cai-2.jpg",
        "Description": "Sau khi dưa héo, rửa thật sạch từng bẹ dưa dưới vòi nước rồi cắt khúc cỡ 2 đốt ngón tay, để ráo nước."
      },
      {
        "Images": "",
        "Description": "Hành lá cắt dễ, rửa sạch xắt khúc. Ớt bỏ cuống, rửa sạch, xắt lát."
      },
      {
        "Images": "Images/dua-cai-3.jpg",
        "Description": "Bình thuỷ tinh rửa sạch, tráng nước sôi và để thật khô. Cho vào bình khoảng 2 lít nước đun sôi để nguội (lượng nước bạn có thể tuỳ chỉnh theo nguyên liêu sao cho đảm bảo phải ngập mặt dưa khi muối). Tiếp đến cho muối vào bình, khuấy tan, nêm sao cho vị mặn hơn khi bạn nấu canh là được."
      }
    ],
    "Ingredients": [
      "Dưa cải bẹ: 1kg (dưa cải nên chọn những cây cải già, không nên chọn cải non quá, không bị giập nát)",
      "Hành lá",
      "Ớt: 2 quả",
      "Muối, đường",
      "2 lít nước đun sôi để nguội",
      "1 bình thuỷ tinh"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Sườn xào chua ngọt",
    "Avatar": "Images/suon-xao-chua-ngot1.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Đun sôi nước, thả sườn vào nấu trong 30 phút thì vớt sườn ra, giữ lại nước dùng."
      },
      {
        "Images": "",
        "Description": "Hòa rượu gia vị , nước tương và 30ml giấm, ướp sườn trong 20 phút."
      },
      {
        "Images": "Images/suon-xao-chua-ngot-10.jpg",
        "Description": "Chiên sơ sườn đã ướp tới khi có màu vàng nhạt."
      },
      {
        "Images": "",
        "Description": "Cho sườn và nước dùng vào nồi, thêm đường và đun cho tới khi cô lại còn khoảng nửa bát nước. Cho muối vào nồi."
      },
      {
        "Images": "",
        "Description": "Cho nhỏ lửa và đun thêm 10 phút, thêm 15ml giấm hoặc điều chỉnh độ chua ngọt theo khẩu vị."
      },
      {
        "Images": "Images/suon-xao-chua-ngot1.jpg",
        "Description": "Bày ra đĩa, rắc vừng lên cho món ăn thêm hấp dẫn."
      }
    ],
    "Ingredients": [
      "500g sườn",
      "15ml rượu gia vị (hoặc rượu gạo)",
      "20ml nước tương",
      "45ml giấm",
      "45g đường",
      "3g muối",
      "3g vừng"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bầu ngâm chua",
    "Avatar": "Images/bau-3.jpg",
    "Step": [
      {
        "Images": "Images/bau-2.jpg",
        "Description": "Bầu để nguyên vỏ, rửa thật sạch, bổ làm đôi, thái lát mỏng vừa ăn."
      },
      {
        "Images": "",
        "Description": "Trải bầu ra rổ hay tấm nilon sạch, phơi nắng to, phơi khoảng 1 ngày để bầu héo."
      },
      {
        "Images": "",
        "Description": "Pha nước muối với nước sôi để nguội, liều lượng các bạn có thể điều chỉnh, nước muối không nên quá mặn. Cho bầu đã phơi héo vào hũ thủy tinh sạch, nước muối phải ngập mặt miếng bầu, cho thêm một thìa nhỏ dấm vào."
      },
      {
        "Images": "Images/bau-3.jpg",
        "Description": "Để nơi thoáng, khoảng 4 - 5 ngày khi thấy bề ngoài vỏ bầu chuyển màu vàng đậm thì có thể chế biến được. Nếu muốn giữ lâu các bạn có thể cho vào tủ lạnh, cất dùng dần."
      }
    ],
    "Ingredients": [
      "1 quả bầu",
      "Muối, dấm"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bánh vừng cười",
    "Avatar": "Images/banh-vung-5.jpg",
    "Step": [
      {
        "Images": "Images/bau-2.jpg",
        "Description": "Hòa tan đường trong nước ấm và đánh tan trứng."
      },
      {
        "Images": "",
        "Description": "Trong một âu khác trộn chung bột mì, bột nổi, sữa bột, muối rồi sau đó cho hỗn hợp nước đường - trứng ở trên vào."
      },
      {
        "Images": "Images/banh-vung-1.jpg",
        "Description": "Thêm dầu ăn vào nhào cho hỗn hợp bột mềm mịn. Nếu dính tay, bạn nên thêm vào khoảng 1 thìa bột mỳ và trộn đều hoặc bọc bằng màng bọc thực phẩm và ủ bột một lúc."
      },
      {
        "Images": "Images/banh-vung-2.jpg",
        "Description": "Sau đó, chia thành 40 phần nhỏ và vo tròn rồi lăn bột qua lớp vừng trắng."
      },
      {
        "Images": "Images/banh-vung-4.jpg",
        "Description": "Đun thật nóng dầu ăn (khoảng 160 độ C) rồi giảm lửa và cho bột vào chiên. Chú ý lượng dầu phải ngập viên bột, chiên với lửa vừa trong khoảng 3 phút. Khuấy bánh liên tục để chúng vàng đều."
      },
      {
        "Images": "Images/banh-vung-5.jpg",
        "Description": "Khi bánh có màu vàng nâu thì vớt ra."
      }
    ],
    "Ingredients": [
      "300g bột mỳ",
      "1,5 thìa cafe bột nổi (baking powder)",
      "1 thìa cafe sữa bột",
      "Một nhúm muối",
      "150g đường kính",
      "50ml nước ấm",
      "2 thìa cafe dầu ăn",
      "1 quả trứng",
      "1 chén vừng trắng"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bánh vừng cười",
    "Avatar": "Images/banh-vung-5.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Hòa tan đường trong nước ấm và đánh tan trứng."
      },
      {
        "Images": "",
        "Description": "Trong một âu khác trộn chung bột mì, bột nổi, sữa bột, muối rồi sau đó cho hỗn hợp nước đường - trứng ở trên vào."
      },
      {
        "Images": "Images/banh-vung-1.jpg",
        "Description": "Thêm dầu ăn vào nhào cho hỗn hợp bột mềm mịn. Nếu dính tay, bạn nên thêm vào khoảng 1 thìa bột mỳ và trộn đều hoặc bọc bằng màng bọc thực phẩm và ủ bột một lúc."
      },
      {
        "Images": "Images/banh-vung-2.jpg",
        "Description": "Sau đó, chia thành 40 phần nhỏ và vo tròn rồi lăn bột qua lớp vừng trắng."
      },
      {
        "Images": "Images/banh-vung-4.jpg",
        "Description": "Đun thật nóng dầu ăn (khoảng 160 độ C) rồi giảm lửa và cho bột vào chiên. Chú ý lượng dầu phải ngập viên bột, chiên với lửa vừa trong khoảng 3 phút. Khuấy bánh liên tục để chúng vàng đều."
      },
      {
        "Images": "Images/banh-vung-5.jpg",
        "Description": "Khi bánh có màu vàng nâu thì vớt ra."
      }
    ],
    "Ingredients": [
      "300g bột mỳ",
      "1,5 thìa cafe bột nổi (baking powder)",
      "1 thìa cafe sữa bột",
      "Một nhúm muối",
      "150g đường kính",
      "50ml nước ấm",
      "2 thìa cafe dầu ăn",
      "1 quả trứng",
      "1 chén vừng trắng"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Kẹo lạc vừng",
    "Avatar": "Images/lac-1.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Chọn lạc hạt to, đều nhau, cho lạc vào chảo, rang nhỏ lửa cho đến khi lạc chín đều. Ủ lạc trong giấy báo 15 phút, sau đó chà xát để bỏ lớp vỏ bên ngoài."
      },
      {
        "Images": "",
        "Description": "Cho vừng trắng vào chảo rang đến khi vừng chuyển màu vàng và có mùi thơm là được."
      },
      {
        "Images": "",
        "Description": "Cho lượng đường đã chuẩn bị vào nồi có đáy dày và rộng, đun nhỏ lửa để đường tan chảy. Lưu ý, phải canh lửa và đảo đường thường xuyên, không để đường bị cháy đắng. Không để đường dính vào thành nồi nếu không rất dễ bị khét."
      },
      {
        "Images": "",
        "Description": "Đến khi đường hơi ngả màu vàng, bạn cho mạch nha vào. Vừa cho, vừa đảo thật nhanh tay để đường và mạch nha hòa quyện vào nhau rồi tắt bếp."
      },
      {
        "Images": "",
        "Description": "Cho lạc vào đảo thật nhanh tay và đều cho đến khi lạc hòa quyện vào với đường."
      },
      {
        "Images": "",
        "Description": "Rắc đều bột nếp lên một cái mâm sạch để chống dính, đổ lạc lên mặt mâm sau đó dùng cán, cán mỏng."
      },
      {
        "Images": "",
        "Description": "Rắc vừng lên bề mặt của kẹo lạc sau đó cán lại một lần nữa cho vừng dính chặt vào kẹo."
      },
      {
        "Images": "",
        "Description": "Dùng một chiếc dao sắc, cắt kẹo lạc thành hình theo sở thích."
      },
      {
        "Images": "Images/lac-2.jpg",
        "Description": "Để kẹo lạc nguội khoảng 30 phút là có thể ăn được, sau đó bạn có thể cho kẹo lạc vào bình thủy tinh đậy nắp lại để bảo quản."
      }
    ],
    "Ingredients": [
      "500 g lạc nhân",
      "100 g vừng trắng",
      "500 g đường trắng",
      "100 g mạch nha",
      "100 g bột nếp"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Sữa ngô",
    "Avatar": "Images/sua-ngo.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Lột vỏ ngô, rửa sạch, luộc chín, vớt ra cho bắp ngô ráo nước."
      },
      {
        "Images": "",
        "Description": "Khi ngô nguội bớt, bạn lấy một con dao sắc tách phần hạt ngô, sau đó cho vào máy xay sinh tố cùng với phần nước luộc ngô, xay thật nhuyễn."
      },
      {
        "Images": "",
        "Description": "Đổ hỗn hợp vừa xay vào túi lọc, bỏ bã lấy nước."
      },
      {
        "Images": "",
        "Description": "Cho sữa tươi vào phần sữa ngô vừa lọc được, thêm chút đường để tăng độ ngọt cho phù hợp với khẩu vị của bạn và gia đình."
      },
      {
        "Images": "",
        "Description": "Đổ hỗn hợp vào nồi, cho lên bếp đun lửa vừa, khuấy liên tục để sữa ngô không bị vón cục do bột ngô đọng ở dưới đáy nồi. Đến khi sữa ngô sôi là dùng được."
      },
      {
        "Images": "Images/sua-ngo.jpg",
        "Description": "Để nguội sữa ngô, đổ ra bình, cho vào ngăn mát tủ lạnh để bảo quản và uống ngon hơn."
      }
    ],
    "Ingredients": [
      "2 bắp ngô ngọt (cho 1 lít sữa ngô)",
      "Sữa tươi: 200 ml (bạn cũng có thể thay bằng sữa đặc nếu muốn sánh hơn)",
      "Đường"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Mì xào gà",
    "Avatar": "Images/mi-xao-1.jpg",
    "Step": [
      {
        "Images": "Images/mi-xao-3.jpg",
        "Description": "Cần tây rửa sạch, thái thành khúc ngắn. Cà rốt thái sợi. Bắp cải, hành lá thái nhỏ. Thịt gà đùi luộc chín rồi cắt thành khúc nhỏ vừa ăn."
      },
      {
        "Images": "",
        "Description": "Bắp chảo lên bếp, cho dầu ăn vào rồi cho tỏi băm vào, phi đều. Cho bắp cải, cần tây, cà rốt đã được thái nhỏ vào chảo, đảo đều. Sau đó cho dầu hào, nước tương đảo đều tay."
      },
      {
        "Images": "",
        "Description": "Bước tiếp theo, khi thấy mì hơi săn, cho thịt gà đã thái vào chảo."
      },
      {
        "Images": "",
        "Description": "Cuối cùng bạn cho mì đã được ráo nước vào hỗn hợp, đảo đều trên bếp. Sau đó cho hành hoa, ớt đập dập vào nữa là hoàn thành."
      },
      {
        "Images": "Images/mi-xao-4.jpg",
        "Description": "Bạn trút mì xào gà ra đĩa và thưởng thức."
      }
    ],
    "Ingredients": [
      "2 gói mì trứng (khoảng 700g)",
      "3 cây cần tây",
      "Nửa củ cà rốt",
      "Hành lá",
      "Thịt đùi hoặc ức gà",
      "Tỏi băm",
      "Nửa cái bắp cải nhỏ",
      "Dầu hào, nước tương",
      "2 quả ớt"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Nộm tai lợn",
    "Avatar": "Images/tai-du-du.jpg",
    "Step": [
      {
        "Images": "Images/tai-lon.jpg",
        "Description": "Đu đủ xanh gọt vỏ, rửa sạch sau đó bào sợi mỏng. Ngâm đu đủ với nước lạnh cho thêm vài viên đá lạnh để đu đủ được giòn ngon lâu hơn. Sau đó, đổ đu đủ ra rổ để cho ráo nước."
      },
      {
        "Images": "",
        "Description": "Tai lợn sau rửa sạch và ngâm với nước muối pha loãng. Cho tai lợn vào xoong luộc chín, cho thêm 2 thìa giấm vào luộc cùng để tai lợn được trắng và giòn.Chỉ nên luộc tai lợn vừa tới chín để đảm bảo độ giòn cho món ăn. Sau đó, bạn vớt tai lợn để ráo nước, thái thật mỏng."
      },
      {
        "Images": "Images/tai-lon-2.jpg",
        "Description": "Giã nhuyễn tỏi và ớt. Sau đó pha nước mắm, cho mắm, đường, nước lọc cùng ớt và tỏi vào khuấy đều."
      },
      {
        "Images": "Images/tai-du-du.jpg",
        "Description": "Trộn đu đủ xanh, tai lợn, ớt bột và nước mắm đã pha sẵn cùng rau răm trộn đều. Đeo găng tay nilon và trộn đều những loại nguyên liệu trên cho thêm nước cốt chanh. Cuối cùng nêm nếm gia vị cho vừa ăn và thưởng thức."
      }
    ],
    "Ingredients": [
      "2 gói mì trứng (khoảng 700g)",
      "3 cây cần tây",
      "Nửa củ cà rốt",
      "Hành lá",
      "Thịt đùi hoặc ức gà",
      "Tỏi băm",
      "Nửa cái bắp cải nhỏ",
      "Dầu hào, nước tương",
      "2 quả ớt"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bánh cam đường",
    "Avatar": "Images/banh-cam-1.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Vo sạch đậu xanh, ngâm mềm rồi nấu chín, sau đó tán nhuyễn."
      },
      {
        "Images": "",
        "Description": "Cho đậu xanh với khoảng 90 gr đường vào nồi sên nhỏ lửa, đến khi đậu khô kết dính thành một khối mịn, sau đó cho vani vào đảo đều."
      },
      {
        "Images": "",
        "Description": "Viên đậu xanh thành từng viên nhỏ để làm nhân bánh."
      },
      {
        "Images": "",
        "Description": "Luộc chín khoai lang, giã mịn."
      },
      {
        "Images": "",
        "Description": "Cho men vào một thau sạch sau đó cho nước ấm vào, sau đó từ từ cho khoai lang, bột vào đảo đều."
      },
      {
        "Images": "",
        "Description": "Để khoảng 30 phút thì viên bột thành những viên như đậu xanh nhưng lớn hơn."
      },
      {
        "Images": "",
        "Description": "Ấn dẹp viên bột, cho nhân đậu xanh vào, nắn cho đẹp mắt, để nghỉ khoảng một tiếng rồi chiên ngập dầu với lửa nhỏ."
      },
      {
        "Images": "",
        "Description": "Khi bánh có màu đỏ sậm, vớt bánh ra để cho ráo dầu."
      },
      {
        "Images": "",
        "Description": "Sau đó cho đường vào nồi nóng đun nhỏ lửa. Khuấy nhẹ cho đến khi đường tan hết, nước đường đã ngả sang màu vàng sậm gần như mật ong thì cho mè vào."
      },
      {
        "Images": "Images/banh-cam-2.jpg",
        "Description": "Nhúng một mặt bánh đã chiên vào hỗn hợp này. Khi nguội, đường sẽ đông tại tạo cho bánh một lớp vỏ bóng rất đẹp mắt."
      }
    ],
    "Ingredients": [
      "340 g bột nếp",
      "60 g bột gạo",
      "7 g men Thái (men Instant Yeast)",
      "80 g khoai lang trắng",
      "150 g đậu xanh",
      "50 g mè",
      "290 g đường",
      "1 ống vani",
      "Dầu ăn 1 lít",
      "Nước ấm 200 ml"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Chân gà nướng",
    "Avatar": "Images/chan-ga-nuong.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Bạn dùng kéo loại bỏ phần móng sắc, rồi tẩm ướp với muối kosher trong khoảng 1 phút. Đổ vào bát ¼ cốc soju và nước lạnh xâm xấp chân gà, ngâm thêm khoảng 20 phút. Sau đó, rửa sạch chân gà dưới vòi nước lạnh, để ráo."
      },
      {
        "Images": "",
        "Description": "Cho chân gà vào nồi hấp, hấp trong khoảng một giờ. Lưu ý kiểm tra nước, nếu cạn, cần cho thêm nước."
      },
      {
        "Images": "",
        "Description": "Trong khi đợi chân gà chín, bạn làm nước sốt bằng cách cho tất cả các thành phần vào một bát lớn và trộn đều."
      },
      {
        "Images": "",
        "Description": "Khi chân gà chín, bạn vớt ra, cho vào bát nước sốt. Trộn đều nước sốt với chân gà, để nguội hẳn rồi cho vào tủ lạnh trong ít nhất 2 giờ đồng hồ."
      },
      {
        "Images": "",
        "Description": "Lấy bát chân gà ra, đặt lên một khay có lót giấy nhôm, rồi đặt vào lò nướng cho đến khi giòn đều."
      },
      {
        "Images": "Images/chan-ga-nuong.jpg",
        "Description": "Bày chân gà lên đĩa, trang trí với dầu mè, hành lá, hạt vừng và thưởng thức."
      }
    ],
    "Ingredients": [
      "500 g chân gà",
      "2 thìa cà phê muối ăn",
      "1/4 cốc rượu soju",
      "Nước sốt: 1 thìa cà phê tương ớt Gochujang",
      "2 thìa cà phê ớt bột",
      "1 thìa cà phê đường",
      "1 thìa cà phê nước tương",
      "1 thìa cà phê dầu hào",
      "1 muỗng canh Mirin (rượu dùng để nấu của Nhật Bản)",
      "3 tép tỏi, băm nhỏ",
      "1/2 muỗng cà phê gừng băm nhỏ",
      "3 quả ớt Thái, xắt nhỏ",
      "1/4 muỗng cà phê hạt tiêu đen"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Thịt ba chỉ kho lạc",
    "Avatar": "Images/ba-chi-lac.jpg",
    "Step": [
      {
        "Images": "Images/ba-chi-1.jpg",
        "Description": "Thịt lợn rửa sạch với nước muối, vớt ra rổ để ráo, thái con chì, cho thịt vào bát, thêm muối, đường rồi trộn đều, ướp trong vòng 30 phút."
      },
      {
        "Images": "Images/lac.jpg",
        "Description": "Lạc cho vào nồi nước, đặt lên bếp luộc sơ, tách bỏ vỏ. Nếu dùng lạc khô, ngâm lạc vào nước ấm khoảng 4-5 tiếng, sau đó đem luộc sơ."
      },
      {
        "Images": "",
        "Description": "Cho đường và nước vào nồi, bắc lên bếp, đun sôi đến khi đường chuyển màu vàng cánh gián, cho hành khô thái nhỏ vào đảo đều."
      },
      {
        "Images": "",
        "Description": "Sau đó cho thịt đã ướp vào nồi, dùng đũa đảo đều để đường bám đều quanh miếng thịt. Sau đó cho thêm một ít nước mắm vào nồi thịt, thêm lạc, đảo đều, đậy kín nắp nồi."
      },
      {
        "Images": "",
        "Description": "Cho thêm hạt nêm, nước mắm, ớt bột vào đảo đều, đậy kín nắp."
      },
      {
        "Images": "Images/ba-chi-lac.jpg",
        "Description": "Đun khoảng 20-30 phút, nêm nếm gia vị cho vừa ăn, đến khi thịt chín, mềm, thấm gia vị thì tắt bếp, rắc một ít hạt tiêu lên bề mặt thịt để giúp món thịt ba chỉ kho lạc thơm ngon hơn."
      }
    ],
    "Ingredients": [
      "500 g chân gà",
      "2 thìa cà phê muối ăn",
      "1/4 cốc rượu soju",
      "Nước sốt: 1 thìa cà phê tương ớt Gochujang",
      "2 thìa cà phê ớt bột",
      "1 thìa cà phê đường",
      "1 thìa cà phê nước tương",
      "1 thìa cà phê dầu hào",
      "1 muỗng canh Mirin (rượu dùng để nấu của Nhật Bản)",
      "3 tép tỏi, băm nhỏ",
      "1/2 muỗng cà phê gừng băm nhỏ",
      "3 quả ớt Thái, xắt nhỏ",
      "1/4 muỗng cà phê hạt tiêu đen"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Cánh gà xốt chua cay",
    "Avatar": "Images/ga-3.jpg",
    "Step": [
      {
        "Images": "Images/ga-1.jpg",
        "Description": "Cánh gà rửa sạch luộc qua nước sôi có gừng và muối khoảng 2 phút. Sau đó đổ gà ra rổ, xả qua nước lạnh cho sạch để ráo. Sau đó, cho gà vào bát bột năng xóc đều."
      },
      {
        "Images": "Images/ga-2.jpg",
        "Description": "Bắc chảo dầu lên bếp, dầu hơi nóng cho cánh gà vào chiên với lửa vừa đến khi cánh gà vàng thì gắp ra dĩa có lót giấy thấm dầu."
      },
      {
        "Images": "",
        "Description": "Bắc chảo lên bếp, cho vào 1 muỗng canh dầu, dầu nóng cho tỏi, hành và ớt cùng các gia vị còn lại vào xào 1-2 phút."
      },
      {
        "Images": "Images/ga-3.jpg",
        "Description": "Sau đó cho xốt tương ớt chua ngọt vào nấu sôi 2 phút. Cuối cùng cho cánh gà vào đảo đều cho xốt bám quanh cánh gà là tắt bếp."
      }
    ],
    "Ingredients": [
      "1 kg cánh gà",
      "100gr bột năng",
      "1 quả ớt sừng băm",
      "3 tép tỏi băm",
      "1 củ gừng nhỏ",
      "3 muỗng canh tương ớt ngọt",
      "3 muỗng canh đường",
      "1 muỗng canh nước mắm",
      "1 muỗng cà phê bột nêm",
      "1 nhánh hành lá thái nhỏ",
      "1 củ hành tím băm"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Cá chiên xù",
    "Avatar": "Images/ca-chien-7.jpg",
    "Step": [
      {
        "Images": "Images/ca-chien-1.jpg",
        "Description": "Cá rửa sạch, lau khô thái miếng nhỏ dài. Ướp vào cá các gia vị phía trên."
      },
      {
        "Images": "Images/ca-chien-3.jpg",
        "Description": "Trứng gà đánh tan trong 1 cái chén."
      },
      {
        "Images": "Images/ca-chien-4.jpg",
        "Description": "Lăn cá vào chén bột, nhúng vào chén trứng. Cuối cùng lăn qua chén bột chiên xù."
      },
      {
        "Images": "Images/ca-chien-6.jpg",
        "Description": "Bắc chảo dầu lên bếp, chờ dầu hơi nóng, cho từng miếng cá vào chiên với lửa vừa. Chiên cho miếng cá vàng đều thì gắp ra đĩa có lót giấy thấm dầu."
      },
      {
        "Images": "Images/ca-chien-7.jpg",
        "Description": "Cá chiên xù ăn kèm với tương ớt hoặc tương cà đều ngon."
      }
    ],
    "Ingredients": [
      "300 gr cá phi lê",
      "1 trứng gà",
      "1 chén bột chiên xù",
      "1/2 chén bột mì",
      "1/3 muỗng cà phê bột tiêu",
      "1/2 muỗng cà phê nước cốt chanh",
      "1 muỗng cà phê bột nêm"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Sữa đậu xanh",
    "Avatar": "Images/sua-1.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Đậu xanh đem đãi sạch và nhặt bỏ những hạt hỏng, ngâm đậu với nước pha thêm chút muối rồi để từ 3 – 4 tiếng. Đậu xanh sau khi được ngâm bạn rửa lại một lần cho thật sạch."
      },
      {
        "Images": "",
        "Description": "Lá dứa rửa sạch."
      },
      {
        "Images": "Images/sua-2.jpg",
        "Description": "Đổ đậu xanh vào nồi cho nước lạnh vào đun đậu cho tới khi mềm và chú ý hớt bọt sạch sẽ."
      },
      {
        "Images": "",
        "Description": "Cho đậu đã nấu chín mềm cùng với đường vào máy xay, xay cho tới khi tạo thành hỗn hợp mịn (nếu đặc có thể cho thêm nước)."
      },
      {
        "Images": "",
        "Description": "Tiếp tục đổ hỗn hợp trong bước 4 vào nồi rồi cho lá nếp vào đun nhỏ lửa khoảng 15-20 phút, chú ý khuấy đều tay và thêm nước cốt dừa."
      },
      {
        "Images": "",
        "Description": "Sau khi cho đủ gia vị cảm thấy vừa khẩu vị các bạn bắc nồi ra, vớt bỏ lá nếp. Sau đó đổ vào một cái lọ thủy tinh để trong tủ lạnh dùng dần (có thể sử dụng trong vòng 1 tuần)."
      },
      {
        "Images": "Images/sua-3.jpg",
        "Description": "Khi dùng, bạn rót sữa đậu xanh ra cốc, cho thêm vài viên đá lạnh và ít sữa tươi, khuấy đều để thưởng thức."
      }
    ],
    "Ingredients": [
      "300g đậu xanh đã tách vỏ",
      "1/4 bát con đường trắng",
      "Nửa thìa nhỏ muối",
      "1 bó lá nếp (lá dứa)",
      "Sữa tươi và đá lạnh",
      "Nước cốt dừa"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Hàu nướng mỡ hành",
    "Avatar": "Images/hau-2.jpg",
    "Step": [
      {
        "Images": "Images/hau-1.jpg",
        "Description": "Hàu làm sạch phần đất cát bên ngoài. Sau đó cho hàu vào lò vi sóng quay trong 1-2 phút là hàu tự hé miệng. Phần nước đọng lại trên thân hàu bạn để nguyên, tránh làm đổ ra ngoài. Phần nước này sẽ làm hàu chín nhanh, không bị cháy thịt giữ được độ ngọt. Hành lá rửa sạch cắt nhỏ."
      },
      {
        "Images": "Images/hau-3.jpg",
        "Description": "Hành khô bóc vỏ, thái lát, sau đó chiên trên chảo nhiều dầu ăn, đến khi thấy hành vàng ruộm giòn giòn thì vớt ra, có thể thấm qua giấy thấm dầu cho dầu trôi bớt."
      },
      {
        "Images": "",
        "Description": "Hàu sau khi đã cạy phần vỏ phía trên, các bạn sơ chế để nướng như sau: Cho 1/2 thìa cà phê hành khô, 1 chút bơ, 1 thìa cà phê mỡ hành, 1 cái tóp mỡ (nếu thích), 1/2 thìa cà phê lạc giã sơ. Cứ làm lần lượt như thế cho đến khi hết số nguyên liệu và hết số hàu."
      },
      {
        "Images": "Images/hau-2.jpg",
        "Description": "Cuối cùng các bạn cho hàu vào lò vi sóng, bấm chế độ nướng 3-4 phút là hàu chín."
      }
    ],
    "Ingredients": [
      "Hàu: 2kg",
      "1 hộp bơ",
      "Mỡ phần: 150g",
      "Hành lá",
      "Hành khô: 2 củ",
      "Lạc rang giã sơ"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Rau lang nấu tôm",
    "Avatar": "Images/tom-1.jpg",
    "Step": [
      {
        "Images": "Images/lang-1.jpg",
        "Description": "Rau khoai lang nhặt bỏ phần già, rửa sạch sau đó thái đoạn vừa ăn. Hành khô: Lột vỏ, rửa sạch, băm nhỏ."
      },
      {
        "Images": "Images/tom-3.jpg",
        "Description": "Tôm sú: Lột vỏ, rút kỹ đường chỉ đen trên sóng lưng tôm, ướp tôm với ½ phần hành băm nhỏ, 1 thìa hạt nêm, ½ thìa bột ngọt, 1 thìa dầu ăn, ½ thìa tiêu trong 15 phút cho tôm ngấm gia vị. Sau đó, cho tôm vào cối, giã nhỏ."
      },
      {
        "Images": "Images/tom-4.jpg",
        "Description": "Cho 3 thìa mỡ nước cùng với tóp mỡ vào nồi, sau đó cho phần hành tỏi băm nhỏ còn lại và ½ thìa ớt bột vào. Tiếp đó, bạn cho tôm đã giã nhỏ vào xào chín săn đều, khi thấy tôm chín săn chuyển qua màu gạch bạn cho vào nồi một lượng nước vừa đủ rồi đun sôi."
      },
      {
        "Images": "Images/tom-1.jpg",
        "Description": "Khi nồi canh sôi, bạn dùng thìa vớt hết phần bọt bên trên rồi nêm nếm thêm gia vị cho vừa miệng, sau đó cho rau vào nồi, đảo nhẹ để rau chín đều, đun sôi thêm 1 phút nữa thì tắt bếp. Không nên cho rau lang sôi lâu quá, rau sẽ bị nhừ làm cho món canh mất ngon. Múc canh ra bát và thưởng thức."
      }
    ],
    "Ingredients": [
      "Rau khoai lang: 1 mớ (nên chọn rau khoai lang xanh non để món canh rau lang nấu tôm ngon ngọt chuẩn vị).",
      "Tôm: 200g (bạn có thể dùng tôm đất, tôm suối, tôm đồng, tôm sú... đều được).",
      "Hành tím: 50g.",
      "Ớt: 3 quả",
      "Gia vị: Mỡ nước (có pha lẫn tóp mỡ), muối, hạt nêm, bột ngọt, tiêu."
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bò cuộn mía nướng",
    "Avatar": "Images/bo-mia-nuong.jpg",
    "Step": [
      {
        "Images": "Images/bo-nuong-1.jpg",
        "Description": "Thịt bò rửa thái thành 10 lát mỏng, to bản. Mía tước bỏ vỏ ngoài, rửa sạch, chẻ thành 10 khúc nhỏ. (Bạn nhớ phải chẻ mía dài hơn thịt bò, để khi cuốn thịt bò còn để dư mía lại làm phần tay cầm). Cà chua rửa sạch, thái lát. Hành tây bóc bỏ vỏ, rửa sạch, thái lát. Tỏi bóc bỏ vỏ, đập dập, băm nhỏ. Hành lá cắt bỏ rễ, rửa sạch, để cả cây dài. Sau đó chần qua nước nóng. Rau mùi, xà lách nhặt rửa sạch, ngâm vào chậu nước muối loãng khoảng 5-10 phút rồi vớt ra rổ để ráo nước."
      },
      {
        "Images": "Images/bo-2.jpg",
        "Description": "Thịt bò cho vào bát to ướp cùng tỏi băm nhỏ, 2 thìa canh dầu ăn, 2 thìa cà phê dầu điều, 2 thìa cà phê tương ớt, 1/2 thìa cà phê muối, 1/2 thìa cà phê đường, 1/2 thìa cà phê ngũ vị hương, trộn đều rồi ướp khoảng 20 phút cho thịt bò ngấm gia vị."
      },
      {
        "Images": "",
        "Description": "Sau khi thịt bò đã ngấm gia vị, bạn trải từng miếng thịt bò ra thớt sạch, rồi cho mía, hành tây vào giữa và cuộn tròn thịt bò lại, sau đó lấy hành lá buộc chặt lại để thịt không bị bung. Bạn làm tương tự đến khi hết nguyên liệu."
      },
      {
        "Images": "Images/bo-mia-nuong.jpg",
        "Description": "Nhóm bếp than hoa, rồi cho vỉ nướng lên trên. Sau đó dải từng miếng bò cuộn mía lên vỉ và nướng tiến hành nướng khoảng 5-10 phút là thịt chín. Khi nướng thịt bạn nên lật đều thịt để thịt không bị khô, cháy."
      }
    ],
    "Ingredients": [
      "Thịt bò phi lê: 200g",
      "Mía: 40g (khoảng nửa cây mía)",
      "Hành tây: 2 củ",
      "Cà chua: 1 quả",
      "Rau mùi, rau xà lách",
      "Tỏi: 1 củ",
      "Hành lá: 3-4 cây",
      "Gia vị: Dầu điều, dầu ăn, tương ớt, đường, muối, hạt tiêu, ngũ vị hương."
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Miến trộn Hàn Quốc",
    "Avatar": "Images/mien-tron-han-quoc.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Rửa sạch thịt bò, để ráo, xắt mỏng. Ướp thịt bò với 15 ml nước tương, một muỗng cà phê đường, 15 ml rượu gạo, 1/2 gram tỏi băm, một muỗng cà phê dầu mè, ít tiêu xay."
      },
      {
        "Images": "",
        "Description": "Gọt bỏ phần gốc già của nấm, ngâm nấm với nước muối pha loãng khoảng 10 phút, xả sạch, để ráo. Xắt nhuyễn. Luộc nhanh nấm qua nước sôi, vớt ra, để nguội, vắt ráo nước. Ướp nấm với 15 ml nước tương (xì dầu), một muỗng cà phê đường, một muỗng cà phê dầu mè, 15 ml rượu gạo."
      },
      {
        "Images": "",
        "Description": "Rửa sạch ớt chuông, xắt sợi. Luộc nhanh ớt, vớt ra, để nguội. Ướp ớt chuông với 15 ml nước tương (xì dầu), một muỗng cà phê đường, một muỗng cà phê dầu mè."
      },
      {
        "Images": "",
        "Description": "Gọt vỏ cà rốt, rửa sạch, bào mỏng. Lột vỏ hành tây, thái múi cau thành 8 phần. Phi thơm tỏi, cho cà rốt, hành tây vào, xào khoảng 2-3 phút cho hai nguyên liệu này chín. Trút ra để riêng."
      },
      {
        "Images": "",
        "Description": "Phi thơm tỏi ở chảo khác, cho thịt bò vào, xào đến khi thịt bò chín, trút ra đĩa, để riêng."
      },
      {
        "Images": "",
        "Description": "Nấu sôi khoảng một lít nước, cho miến vào. Khuấy nhẹ để miến không dính vào nhau. Luộc miến khoảng 6-7 phút đến khi mềm. Trút miến ra rổ, trụng nhanh qua nước lạnh, xóc ráo. Bạn có thể dùng kéo cắt ngắn nếu miến quá dài."
      },
      {
        "Images": "",
        "Description": "Lần lượt cho miến, thịt bò xào, cà rốt, hành tây, nấm, ớt chuông và 35 ml nước tương, hai muỗng cà phê đường, hai muỗng cà phê dầu mè, rượu soju, trộn đều các thành phần với nhau. Nêm nếm vừa miệng."
      },
      {
        "Images": "Images/mien-tron-han-quoc.jpg",
        "Description": "Lấy miến trộn ra đĩa, rắc mè lên trên, thưởng thức."
      }
    ],
    "Ingredients": [
      "300 gram miến Hàn Quốc",
      "150 gram thịt bò",
      "1 củ cà rốt",
      "1 củ hành tây",
      "100 gram nấm đùi gà",
      "1 trái ớt chuông",
      "80 ml nước tương (xì dầu)",
      "4 muỗng cà phê đường",
      "30 ml rượu gạo",
      "1 muỗng cà phê tỏi bằm",
      "4 muỗng cà phê dầu mè",
      "1/6 muỗng cà phê tiêu xay",
      "30 gram mè xay"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Mứt dừa",
    "Avatar": "Images/dua-4.jpg",
    "Step": [
      {
        "Images": "Images/dua-1.jpg",
        "Description": "Trước tiên, bạn cần nạo hết lớp vỏ cứng bên ngoài cùi dừa rồi mang đi rửa sạch. Sau đó, bạn dùng nạo và tiến hành nạo vòng quanh quả dừa để được những miếng mứt có sợi dài và dẻo dai."
      },
      {
        "Images": "Images/dua-2.jpg",
        "Description": "Sau khi đã nạo dừa xong, bạn nên rửa dừa khoảng 2 - 3 lần và ngâm vào nước sạch từ 8 - 12 giờ để loại bớt dầu dừa. Sau đó, bạn vớt sợi dừa ra và rửa với nước sạch thêm 2 - 3 lần. Khi nước rửa sợi dừa chuyển sang màu trắng trong vắt, bạn vớt ra rổ khô, để ráo nước. Bạn cũng có thể ngâm cùi dừa vào nước ấm khoảng 75 – 80 độ để khử dầu dừa nhanh và tiết kiệm thời gian."
      },
      {
        "Images": "Images/dua-3.jpg",
        "Description": "Khi sợi dừa đã ráo nước, bạn để sợi dừa ra một chiếc chậu vừa phải, tiến hành ướp dừa với 250g đường kính trắng. Bạn nên để dừa ngấm đường khoảng 30 phút, rồi tiếp tục cho nửa ống vani và một lượng sữa đặc vừa phải, thi thoảng lại đảo đều một lần. Sau đó, bạn chờ khoảng 10 – 12 tiếng cho cùi dừa ngấm với đường, khi nào sợi dừa chuyển sang màu trong suốt thì mang đi sao."
      },
      {
        "Images": "Images/dua-4.jpg",
        "Description": "Bây giờ đã có một mẻ dừa hoàn hảo sẵn sàng để sao. Để sao dừa, bạn nên chọn một chiếc chảo rộng, lòng chảo bằng. Để dừa có chất lượng tốt nhất, bạn đặt chảo lên bếp, bật lửa to cho chảo khô, nóng già sau đó đổ hỗn hợp cùi dừa (chú ý đổ hết cả phần nước chảy ra) và đảo đều tay. Khi đổ hỗ hợp cùi dừa vào chảo, bạn phải điều chỉnh lại ngọn lửa nhỏ nhất, tránh để lửa to khiến dừa nhanh cháy, bị vón cục. Khi đảo dừa thấy nặng tay, nước đường đã cạn, bạn cần đảo liên tục, tách các sợi dừa đừng để dính vào nhau. Khoảng 5 phút sau khi đảo dừa nặng tay, sợi dừa sẽ dần tách rời nhau và có phấn trắng bám trên mặt. Bạn tắt bếp và tiếp tục đảo dừa cho đến khi sợi dừa tách hẳn và nguội dần."
      }
    ],
    "Ingredients": [
      "1 quả dừa bánh tẻ: 500g",
      "250g đường kính trắng",
      "Khoảng 200 gram sữa đặc (tuỳ sở thích)",
      "1 ống vani"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bánh takoyaki",
    "Avatar": "Images/banh-bach-tuoc.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Làm sạch bạch tuộc, rửa với rượu trắng, để ráo. Lột vỏ tôm, dùng tăm nhọn rút chỉ. Hấp cách thủy bạch tuộc và tôm với sả đập dập, gừng tươi xắt lát. Khi tôm và bạch tuộc chín, để nguội, xắt nhỏ. Lột vỏ hành tây, rửa sạch, xắt nhỏ. Gọt bỏ phần già của nấm rơm, ngâm nấm với nước muối pha loãng, xả sạch, để ráo, xắt nhỏ."
      },
      {
        "Images": "",
        "Description": "Lần lượt cho bột takoyaki, nước, bạch tuộc, tôm, nấm, hành tây, phô mai, trứng vào tô hay thau, quậy đều đến khi tạo thành hỗn hợp bột có độ sánh đặc thì dừng lại. "
      },
      {
        "Images": "",
        "Description": "Làm nóng khuôn nướng bánh, phết dầu lên từng khuôn."
      },
      {
        "Images": "",
        "Description": "Múc hỗn hợp bột vào khuôn. Nướng bánh khoảng 3 phút. Sau 3 phút, dùng que tre lật bánh nướng cho tròn đều. Nướng đến khi bánh chín và ngả màu vàng là được. Làm lần lượt cho đến khi hết hỗn hợp bột."
      },
      {
        "Images": "Images/banh-bach-tuoc.jpg",
        "Description": "Cho bánh ra đĩa, rưới thêm sốt mayonnaise, sốt okonomiyaki, cá bào katsuobushi và bột rong biển aonori lên trên."
      }
    ],
    "Ingredients": [
      "150 gram bột takoyaki (hoặc bột mì)",
      "250 ml nước ",
      "100 gram bạch tuộc",
      "40 gram tôm tươi",
      "1 quả trứng",
      "40 gram hành tây",
      "2 muỗng canh phô mai",
      "50 gram nấm rơm",
      "50 ml dầu ăn",
      "50 ml sốt mayonnaise",
      "50 ml sốt okonomiyaki",
      "50 gram cá bào katsuobushi",
      "30 gram bột rong biển aonori"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Sườn non tẩm bột chiên giòn",
    "Avatar": "Images/suon-non-tam-bot-1.jpg",
    "Step": [
      {
        "Images": "Images/suon-non-tam-bot-2.jpg",
        "Description": "Sườn rửa sạch, ngâm với rượu pha nước khoảng 20 phút. Gừng và tỏi băm nhỏ. Cho sườn cùng gừng, tỏi, bột ớt, sa tế, mật ong, nước mắm vào trong một túi nilon hoặc hộp nhựa. Lắc đều cho sườn thấm gia vị."
      },
      {
        "Images": "Images/suon-non-tam-bot-3.jpg",
        "Description": "Đặt sườn vào trong ngăn mát tủ lạnh từ 6 đến 8 tiếng. Khi đủ thời gian, lấy sườn ra hấp khoảng 5 phút. Sau đó đem nhúng ngay vào hỗn hợp bột mì, bột ngô, hạt tiêu, sa tế và dầu ô liu."
      },
      {
        "Images": "Images/suon-non-tam-bot-4.jpg",
        "Description": "Chiên từng miếng sườn trong chảo ngập dầu đến khi chuyển qua màu vàng nâu là được. Vớt sườn ra để trên giấy thấm dầu, sau đó trình bày ra đĩa. "
      }
    ],
    "Ingredients": [
      "5 đến 10 thanh sườn lợn",
      "2,5 muỗng canh nước mắm",
      "Gừng, tỏi",
      "1 muỗng canh mật ong",
      "1 muỗng canh rượu trắng",
      "1 muỗng cà phê bột nghệ, bột ớt, hạt tiêu",
      "1 muỗng canh dầu ô liu",
      "3 muỗng canh bột mì",
      "1,5 muỗng canh bột ngô"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Canh măng khô móng giò",
    "Avatar": "Images/canh-mang-kho-2.jpg",
    "Step": [
      {
        "Images": "Images/canh-mang-kho.jpg",
        "Description": "Măng khô cắt bớt đoạn già, xé măng thành từng sợi vừa ăn, ngâm nước lạnh khoảng hơn một ngày. Thỉnh thoảng thay nước để măng ra bớt vị chua và có nước trong. Sau luộc măng, đổ ra rổ cho ráo nước."
      },
      {
        "Images": "Images/chan-gio.jpg",
        "Description": "Móng giò chặt nhỏ cho vào nồi nước, bắc bếp lên đun sôi để rửa xương sau đó rửa lại đổ nước đi, rửa dưới vòi nước lạnh cho hết vụn xương. Cho xương vào nồi, thêm chút gia vị xào thơm. Sau đó đổ ngập nước, đun sôi rồi vặn nhỏ lửa hầm đến khi xương mềm vừa ăn."
      },
      {
        "Images": "Images/canh-mang-kho-2.jpg",
        "Description": "Đun nóng hai thìa nhỏ dầu ăn, phi hành thơm, đổ măng vào xào, thêm vào hai thìa nhỏ nước mắm, một thìa nhỏ muối, nửa thìa hạt nêm, hạt tiêu. Đun tầm 5 phút. Sau đó đổ vào nồi nước xương sao cho nước ngập mặt xương và măng, tiếp tục đun sôi đến khi măng và thịt mềm, nêm nếm lại tùy theo khẩu vị của bạn. Tắt bếp, rắc hành lá, rau mùi đã thái nhỏ. Múc ra bát và thưởng thức."
      }
    ],
    "Ingredients": [
      "200g măng khô",
      "400g móng giò (bạn có thể thay thế bằng xương lợn)",
      "Nước mắm, muối, hạt nêm, tiêu",
      "Hành lá và rau mùi thái nhỏ",
      "Hành hoa"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bún cá lóc",
    "Avatar": "Images/bun.jpg",
    "Step": [
      {
        "Images": "",
        "Description": "Đập dập sả cây. Xắt lát chanh. Gọt vỏ nghệ, xắt nhuyễn. Nhặt hẹ, rửa sạch, cắt khúc dài khoảng 4 cm. Nhặt húng cây, rau đắng đất rửa sạch, để ráo. Gọt vỏ ngải bún, đập dập. Xắt lát ớt sừng. Nhặt hành lá, rửa sạch, xắt nhuyễn. Ngâm bắp chuối bào, giá, rau muống bào với nước muối loãng, xả sạch, để ráo. Làm sạch cá lóc, dùng muối chà nhẹ thân cá để loại bỏ chất nhờn."
      },
      {
        "Images": "",
        "Description": "Đun sôi 2 lít nước. Khi nước sôi, luộc cá với ít gừng xắt lát, sả đập dập. Cá chín, vớt ra, để ráo. Lọc nước luộc cá qua ray để loại bỏ vụn cá. Ta có nước dùng (1)."
      },
      {
        "Images": "",
        "Description": "Gỡ thịt cá ra khỏi xương, ướp cá với nước mắm ngon, tiêu, bột ngọt, và 1/2 nghệ tươi xắt nhuyễn. Để cá đã ướp trong ngăn mát tủ lạnh qua đêm hay ít nhất là 3 tiếng. Phi thơm tỏi, xào cá trên lửa lớn. Khi xào, đảo nhẹ để miếng cá không bị bể."
      },
      {
        "Images": "",
        "Description": "Rửa sạch xương gà, chặt miếng vừa ăn. Trụng xương gà với nước sôi, để ráo."
      },
      {
        "Images": "",
        "Description": "Đun sôi nước dùng (1), cho xương gà vào hầm khoảng 30 phút. Lọc nước hầm gà qua rây để lấy nước dùng. Ta có nước dùng (2)"
      },
      {
        "Images": "",
        "Description": "Phi thơm tỏi, cho nghệ tươi vào, xào sơ. Trút nghệ tươi vừa xào vào nồi nước dùng (2) đang sôi. Tiếp đó, cho mắm linh đã lọc, sả cây, ớt sừng, ngải bún, trái thơm vào. Khi nước sôi lần nữa, nêm đường, bột ngọt vừa ăn."
      },
      {
        "Images": "Images/bun-ca-loc.jpg",
        "Description": " Trụng bún cho vào tô, cho cá lóc lên trên cuối cùng chan nước dùng rồi rắc hẹ, hành lá, tiêu lên trên. Bún nước lèo cá lóc miền Tây ăn cùng rau muống, rau húng, giá, rau đắng đất."
      }
    ],
    "Ingredients": [
      "100 gram mắm cá linh",
      "2 kg cá lóc",
      "2 bộ xương gà",
      "500 gram bún sợi nhỏ",
      "300 gram giá, hẹ, bắp chuối bào",
      "200 gram rau đắng đất",
      "50 gram húng cây",
      "5 cây sả",
      "5 trái ớt sừng",
      "1 trái chanh",
      "50 gram ngải bún",
      "1 muỗng cà phê bột ngọt",
      "1 thìa súp đường",
      "2 lít nước lọc",
      "1 trái thơm (để thanh nước dùng)",
      "100 gram nghệ tươi",
      "Hành lá: 50 gram",
      "Gừng tươi: 50 gram"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bánh vừng cười",
    "Avatar": "Images/banh-vung-5.jpg",
    "Step": null,
    "Ingredients": [
      "300g bột mỳ",
      "1,5 thìa cafe bột nổi (baking powder)",
      "1 thìa cafe sữa bột",
      "Một nhúm muối",
      "150g đường kính",
      "50ml nước ấm",
      "2 thìa cafe dầu ăn",
      "1 quả trứng",
      "1 chén vừng trắng"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bánh vừng cười",
    "Avatar": "Images/banh-vung-5.jpg",
    "Step": null,
    "Ingredients": [
      "300g bột mỳ",
      "1,5 thìa cafe bột nổi (baking powder)",
      "1 thìa cafe sữa bột",
      "Một nhúm muối",
      "150g đường kính",
      "50ml nước ấm",
      "2 thìa cafe dầu ăn",
      "1 quả trứng",
      "1 chén vừng trắng"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bánh vừng cười",
    "Avatar": "Images/banh-vung-5.jpg",
    "Step": null,
    "Ingredients": [
      "300g bột mỳ",
      "1,5 thìa cafe bột nổi (baking powder)",
      "1 thìa cafe sữa bột",
      "Một nhúm muối",
      "150g đường kính",
      "50ml nước ấm",
      "2 thìa cafe dầu ăn",
      "1 quả trứng",
      "1 chén vừng trắng"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bánh vừng cười",
    "Avatar": "Images/banh-vung-5.jpg",
    "Step": null,
    "Ingredients": [
      "300g bột mỳ",
      "1,5 thìa cafe bột nổi (baking powder)",
      "1 thìa cafe sữa bột",
      "Một nhúm muối",
      "150g đường kính",
      "50ml nước ấm",
      "2 thìa cafe dầu ăn",
      "1 quả trứng",
      "1 chén vừng trắng"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Bánh vừng cười",
    "Avatar": "Images/banh-vung-5.jpg",
    "Step": [
      {
        "Images": "Images / banh - vung - 2.jpg",
        "Description": "Thêm dầu ăn vào nhào cho hỗn hợp bột mềm mịn.Nếu dính tay, bạn nên thêm vào khoảng 1 thìa bột mỳ và trộn đều hoặc bọc bằng màng bọc thực phẩm và ủ bột một lúc"
      }
    ],
    "Ingredients": [
      "300g bột mỳ",
      "1,5 thìa cafe bột nổi (baking powder)",
      "1 thìa cafe sữa bột",
      "Một nhúm muối",
      "150g đường kính",
      "50ml nước ấm",
      "2 thìa cafe dầu ăn",
      "1 quả trứng",
      "1 chén vừng trắng"
    ],
    "VideoLink": "",
    "Favorite": false
  },
  {
    "Name": "Món ăn qq",
    "Avatar": "C:\\Users\\Dell\\Pictures\\bbb.jpg",
    "Step": [
      {
        "Images": "C:\\Users\\Dell\\Pictures\\IMG_0204.HEIC",
        "Description": "StepDescriptionưewewe"
      },
      {
        "Images": "C:\\Users\\Dell\\Pictures\\IMG_0204.HEIC",
        "Description": "StepDescriptionưewewe"
      },
      {
        "Images": "C:\\Users\\Dell\\Pictures\\IMG_0204.HEIC",
        "Description": "StepDescriptionưeweweewew"
      }
    ],
    "Ingredients": [
      "ingre"
    ],
    "VideoLink": "https://www.youtube.com/watch?v=LwGtIzFyUW0&ab_channel=Nguy%C3%AAn",
    "Favorite": false
  },
  {
    "Name": "Món ăn qq 2",
    "Avatar": "C:\\Users\\Dell\\Pictures\\18ec56005a3da063f92c.jpg",
    "Step": [
      {
        "Images": "C:\\Users\\Dell\\Pictures\\bbb.jpg",
        "Description": "StepDescriptionsds"
      },
      {
        "Images": "C:\\Users\\Dell\\Pictures\\bbb.jpg",
        "Description": "StepDescriptionsdsdsds"
      }
    ],
    "Ingredients": [
      "ingre"
    ],
    "VideoLink": "https://www.youtube.com/watch?v=LwGtIzFyUW0&ab_channel=Nguy%C3%AAn",
    "Favorite": false
  },
  {
    "Name": "Mẹo muối dưa cải giòn ngon không bị khú",
    "Avatar": "C:\\tranhuynh\\Lập trình Windows\\1712507_TroChoiDoan\\Source\\Trò chơi đoán chữ\\Trò chơi đoán chữ\\Images\\Andrea Pirlo.jpg",
    "Step": [
      {
        "Images": "C:\\tranhuynh\\Lập trình Windows\\1712507_TroChoiDoan\\Source\\Trò chơi đoán chữ\\Trò chơi đoán chữ\\Images\\Arjen Robben.jpg",
        "Description": "B1"
      },
      {
        "Images": "C:\\tranhuynh\\Lập trình Windows\\1712507_TroChoiDoan\\Source\\Trò chơi đoán chữ\\Trò chơi đoán chữ\\Images\\Arjen Robben.jpg",
        "Description": "B2"
      }
    ],
    "Ingredients": [
      " \"500 g chân gà\","
    ],
    "VideoLink": "https://www.youtube.com/watch?v=wq4_z7u5NP8",
    "Favorite": false
  },
  {
    "Name": "Đỗ Trần Huỳnh",
    "Avatar": "C:\\tranhuynh\\Lập trình Windows\\1712507_TroChoiDoan\\Source\\Trò chơi đoán chữ\\Trò chơi đoán chữ\\Images\\Francesco Totti.jpg",
    "Step": [
      {
        "Images": "C:\\tranhuynh\\Lập trình Windows\\1712507_TroChoiDoan\\Source\\Trò chơi đoán chữ\\Trò chơi đoán chữ\\Images\\Carles Puyol.jpg",
        "Description": "dsads\r\nadsads"
      }
    ],
    "Ingredients": [
      "dsadad\r\nadsad\r\nadasd\r\nads"
    ],
    "VideoLink": "https://www.youtube.com/watch?v=LwGtIzFyUW0&ab_channel=Nguy%C3%AAn",
    "Favorite": false
  }
]